OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f65j94.h
#define _S08C0                  0x01
#define _S09C0                  0x02
#define _S10C0                  0x04
#define _S11C0                  0x08
#define _S12C0                  0x10
#define _S13C0                  0x20
#define _S14C0                  0x40
#define _S15C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA2 Bits

extern __at(0x0E90) __sfr LCDDATA2;

typedef struct
  {
  unsigned S16C0                : 1;
  unsigned S17C0                : 1;
  unsigned S18C0                : 1;
  unsigned S19C0                : 1;
  unsigned S20C0                : 1;
  unsigned S21C0                : 1;
  unsigned S22C0                : 1;
  unsigned S23C0                : 1;
  } __LCDDATA2bits_t;

extern __at(0x0E90) volatile __LCDDATA2bits_t LCDDATA2bits;

#define _S16C0                  0x01
#define _S17C0                  0x02
#define _S18C0                  0x04
#define _S19C0                  0x08
#define _S20C0                  0x10
#define _S21C0                  0x20
#define _S22C0                  0x40
#define _S23C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA3 Bits

extern __at(0x0E91) __sfr LCDDATA3;

typedef struct
  {
  unsigned S24C0                : 1;
  unsigned S25C0                : 1;
  unsigned S26C0                : 1;
  unsigned S27C0                : 1;
  unsigned S28C0                : 1;
  unsigned S29C0                : 1;
  unsigned S30C0                : 1;
  unsigned S31C0                : 1;
  } __LCDDATA3bits_t;

extern __at(0x0E91) volatile __LCDDATA3bits_t LCDDATA3bits;

#define _S24C0                  0x01
#define _S25C0                  0x02
#define _S26C0                  0x04
#define _S27C0                  0x08
#define _S28C0                  0x10
#define _S29C0                  0x20
#define _S30C0                  0x40
#define _S31C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA4 Bits

extern __at(0x0E92) __sfr LCDDATA4;

typedef struct
  {
  unsigned S32C0                : 1;
  unsigned S33C0                : 1;
  unsigned S34C0                : 1;
  unsigned S35C0                : 1;
  unsigned S36C0                : 1;
  unsigned S37C0                : 1;
  unsigned S38C0                : 1;
  unsigned S39C0                : 1;
  } __LCDDATA4bits_t;

extern __at(0x0E92) volatile __LCDDATA4bits_t LCDDATA4bits;

#define _S32C0                  0x01
#define _S33C0                  0x02
#define _S34C0                  0x04
#define _S35C0                  0x08
#define _S36C0                  0x10
#define _S37C0                  0x20
#define _S38C0                  0x40
#define _S39C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA5 Bits

extern __at(0x0E93) __sfr LCDDATA5;

typedef struct
  {
  unsigned S40C0                : 1;
  unsigned S41C0                : 1;
  unsigned S42C0                : 1;
  unsigned S43C0                : 1;
  unsigned S44C0                : 1;
  unsigned S45C0                : 1;
  unsigned S46C0                : 1;
  unsigned S47C0                : 1;
  } __LCDDATA5bits_t;

extern __at(0x0E93) volatile __LCDDATA5bits_t LCDDATA5bits;

#define _S40C0                  0x01
#define _S41C0                  0x02
#define _S42C0                  0x04
#define _S43C0                  0x08
#define _S44C0                  0x10
#define _S45C0                  0x20
#define _S46C0                  0x40
#define _S47C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA6 Bits

extern __at(0x0E94) __sfr LCDDATA6;

typedef struct
  {
  unsigned S48C0                : 1;
  unsigned S49C0                : 1;
  unsigned S50C0                : 1;
  unsigned S51C0                : 1;
  unsigned S52C0                : 1;
  unsigned S53C0                : 1;
  unsigned S54C0                : 1;
  unsigned S55C0                : 1;
  } __LCDDATA6bits_t;

extern __at(0x0E94) volatile __LCDDATA6bits_t LCDDATA6bits;

#define _S48C0                  0x01
#define _S49C0                  0x02
#define _S50C0                  0x04
#define _S51C0                  0x08
#define _S52C0                  0x10
#define _S53C0                  0x20
#define _S54C0                  0x40
#define _S55C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA7 Bits

extern __at(0x0E95) __sfr LCDDATA7;

typedef struct
  {
  unsigned S56C0                : 1;
  unsigned S57C0                : 1;
  unsigned S58C0                : 1;
  unsigned S59C0                : 1;
  unsigned S60C0                : 1;
  unsigned S61C0                : 1;
  unsigned S62C0                : 1;
  unsigned S63C0                : 1;
  } __LCDDATA7bits_t;

extern __at(0x0E95) volatile __LCDDATA7bits_t LCDDATA7bits;

#define _S56C0                  0x01
#define _S57C0                  0x02
#define _S58C0                  0x04
#define _S59C0                  0x08
#define _S60C0                  0x10
#define _S61C0                  0x20
#define _S62C0                  0x40
#define _S63C0                  0x80

//==============================================================================


//==============================================================================
//        LCDDATA8 Bits

