OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f65j94.h
extern __at(0x0F60) __sfr DMACON1;

typedef union
  {
  struct
    {
    unsigned DMAEN              : 1;
    unsigned DLYINTEN           : 1;
    unsigned DUPLEX0            : 1;
    unsigned DUPLEX1            : 1;
    unsigned RXINC              : 1;
    unsigned TXINC              : 1;
    unsigned SSCON0             : 1;
    unsigned SSCON1             : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned DUPLEX             : 2;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 6;
    unsigned SSCON              : 2;
    };
  } __DMACON1bits_t;

extern __at(0x0F60) volatile __DMACON1bits_t DMACON1bits;

#define _DMAEN                  0x01
#define _DLYINTEN               0x02
#define _DUPLEX0                0x04
#define _DUPLEX1                0x08
#define _RXINC                  0x10
#define _TXINC                  0x20
#define _SSCON0                 0x40
#define _SSCON1                 0x80

//==============================================================================


//==============================================================================
//        PIE6 Bits

extern __at(0x0F61) __sfr PIE6;

typedef struct
  {
  unsigned CMP1IE               : 1;
  unsigned CMP2IE               : 1;
  unsigned CMP3IE               : 1;
  unsigned                      : 1;
  unsigned TX3IE                : 1;
  unsigned RC3IE                : 1;
  unsigned TX4IE                : 1;
  unsigned RC4IE                : 1;
  } __PIE6bits_t;

extern __at(0x0F61) volatile __PIE6bits_t PIE6bits;

#define _CMP1IE                 0x01
#define _CMP2IE                 0x02
#define _CMP3IE                 0x04
#define _TX3IE                  0x10
#define _RC3IE                  0x20
#define _TX4IE                  0x40
#define _RC4IE                  0x80

//==============================================================================


//==============================================================================
//        WPUB Bits

extern __at(0x0F62) __sfr WPUB;

typedef struct
  {
  unsigned WPUB0                : 1;
  unsigned WPUB1                : 1;
  unsigned WPUB2                : 1;
  unsigned WPUB3                : 1;
  unsigned WPUB4                : 1;
  unsigned WPUB5                : 1;
  unsigned WPUB6                : 1;
  unsigned WPUB7                : 1;
  } __WPUBbits_t;

extern __at(0x0F62) volatile __WPUBbits_t WPUBbits;

#define _WPUB0                  0x01
#define _WPUB1                  0x02
#define _WPUB2                  0x04
#define _WPUB3                  0x08
#define _WPUB4                  0x10
#define _WPUB5                  0x20
#define _WPUB6                  0x40
#define _WPUB7                  0x80

//==============================================================================


//==============================================================================
//        ACTCON Bits

extern __at(0x0F63) __sfr ACTCON;

typedef struct
  {
  unsigned ACTORSPOL            : 1;
  unsigned ACTORS               : 1;
  unsigned ACTLOCKPOL           : 1;
  unsigned ACTLOCK              : 1;
  unsigned ACTSRC               : 1;
  unsigned ACTSIDL              : 1;
  unsigned                      : 1;
  unsigned ACTEN                : 1;
  } __ACTCONbits_t;

extern __at(0x0F63) volatile __ACTCONbits_t ACTCONbits;

#define _ACTORSPOL              0x01
#define _ACTORS                 0x02
#define _ACTLOCKPOL             0x04
#define _ACTLOCK                0x08
#define _ACTSRC                 0x10
#define _ACTSIDL                0x20
#define _ACTEN                  0x80

//==============================================================================


//==============================================================================
//        OSCCON4 Bits

extern __at(0x0F64) __sfr OSCCON4;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PLLEN              : 1;
    unsigned CPDIV0             : 1;
    unsigned CPDIV1             : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned CPDIV              : 2;
    };
  } __OSCCON4bits_t;

extern __at(0x0F64) volatile __OSCCON4bits_t OSCCON4bits;

#define _PLLEN                  0x20
#define _CPDIV0                 0x40
#define _CPDIV1                 0x80

//==============================================================================


//==============================================================================
//        OSCCON3 Bits

extern __at(0x0F65) __sfr OSCCON3;

typedef union
  {
  struct
    {
    unsigned IRCF0              : 1;
    unsigned IRCF1              : 1;
    unsigned IRCF2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned IRCF               : 3;
    unsigned                    : 5;
    };
  } __OSCCON3bits_t;

extern __at(0x0F65) volatile __OSCCON3bits_t OSCCON3bits;

#define _IRCF0                  0x01
#define _IRCF1                  0x02
#define _IRCF2                  0x04

//==============================================================================


//==============================================================================
//        OSCCON2 Bits

extern __at(0x0F66) __sfr OSCCON2;

typedef struct
  {
  unsigned                      : 1;
  unsigned SOSCGO               : 1;
  unsigned POSCEN               : 1;
  unsigned CF                   : 1;
  unsigned                      : 1;
  unsigned LOCK                 : 1;
  unsigned IOLOCK               : 1;
  unsigned CLKLOCK              : 1;
  } __OSCCON2bits_t;

extern __at(0x0F66) volatile __OSCCON2bits_t OSCCON2bits;

#define _SOSCGO                 0x02
#define _POSCEN                 0x04
#define _CF                     0x08
#define _LOCK                   0x20
#define _IOLOCK                 0x40
#define _CLKLOCK                0x80

//==============================================================================


//==============================================================================
//        BAUDCON Bits

extern __at(0x0F67) __sfr BAUDCON;

typedef union
  {
  struct
    {
    unsigned ABDEN              : 1;
    unsigned WUE                : 1;
    unsigned IREN               : 1;
    unsigned BRG16              : 1;
    unsigned TXCKP              : 1;
    unsigned RXDTP              : 1;
    unsigned RCIDL              : 1;
    unsigned ABDOVF             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CKTXP              : 1;
    unsigned DTRXP              : 1;
    unsigned RCMT               : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SCKP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __BAUDCONbits_t;

extern __at(0x0F67) volatile __BAUDCONbits_t BAUDCONbits;

#define _ABDEN                  0x01
#define _WUE                    0x02
#define _IREN                   0x04
#define _BRG16                  0x08
#define _TXCKP                  0x10
#define _CKTXP                  0x10
#define _SCKP                   0x10
#define _RXDTP                  0x20
#define _DTRXP                  0x20
#define _RCIDL                  0x40
#define _RCMT                   0x40
#define _ABDOVF                 0x80

//==============================================================================


//==============================================================================
//        BAUDCON1 Bits

extern __at(0x0F67) __sfr BAUDCON1;

typedef union
  {
  struct
    {
    unsigned ABDEN              : 1;
    unsigned WUE                : 1;
    unsigned IREN               : 1;
    unsigned BRG16              : 1;
    unsigned TXCKP              : 1;
    unsigned RXDTP              : 1;
    unsigned RCIDL              : 1;
    unsigned ABDOVF             : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CKTXP              : 1;
    unsigned DTRXP              : 1;
    unsigned RCMT               : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SCKP               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __BAUDCON1bits_t;

extern __at(0x0F67) volatile __BAUDCON1bits_t BAUDCON1bits;

#define _BAUDCON1_ABDEN         0x01
#define _BAUDCON1_WUE           0x02
#define _BAUDCON1_IREN          0x04
#define _BAUDCON1_BRG16         0x08
#define _BAUDCON1_TXCKP         0x10
#define _BAUDCON1_CKTXP         0x10
#define _BAUDCON1_SCKP          0x10
#define _BAUDCON1_RXDTP         0x20
#define _BAUDCON1_DTRXP         0x20
#define _BAUDCON1_RCIDL         0x40
#define _BAUDCON1_RCMT          0x40
#define _BAUDCON1_ABDOVF        0x80

//==============================================================================


//==============================================================================
//        SSP1MSK Bits

extern __at(0x0F68) __sfr SSP1MSK;

typedef struct
  {
  unsigned MSK0                 : 1;
  unsigned MSK1                 : 1;
  unsigned MSK2                 : 1;
  unsigned MSK3                 : 1;
  unsigned MSK4                 : 1;
  unsigned MSK5                 : 1;
  unsigned MSK6                 : 1;
  unsigned MSK7                 : 1;
  } __SSP1MSKbits_t;

